Revit 2024 API
DuctFittingAndAccessoryData.SystemClassification Property
 The system classification of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MEPSystemClassification SystemClassification { get; }
Visual Basic
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
Visual C++
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace